{
    "docs\\doc1.txt": "$William Blake (Johnny Depp), an accountant from Cleveland, Ohio, rides by train to the frontier company town of Machine to take up a promised accounting job in the town's metal works. During the trip, the train fireman (Crispin Glover) warns Blake against the enterprise. Arriving in town, Blake notes the hostility of the townsfolk towards him. He then discovers that the position has already been filled, and John Dickinson (Robert Mitchum), the ferocious owner of the company, drives Blake from the workplace by gunpoint.",
    "docs\\doc2.txt": "In 1848, Garibaldi returned to Italy and commanded and fought in military campaigns that eventually led to Italian unification. The provisional government of Milan made him a general and the Minister of War promoted him to General of the Roman Republic in 1849. When the war of independence broke out in April 1859, he led his Hunters of the Alps in the capture of major cities in Lombardy, including Varese and Como, and reached the frontier of South Tyrol; the war ended with the acquisition of Lombardy. The following year, he led the Expedition of the Thousand on behalf of and with the consent of Victor Emmanuel II. The expedition was a success and concluded with the annexation of Sicily, Southern Italy, Marche and Umbria to the Kingdom of Sardinia before the creation of a unified Kingdom of Italy on 17 March 1861. His last military campaign took place during the Franco-Prussian War as commander of the Army of the Vosges. ",
    "docs\\doc3.txt": "Capped 108 times by France, Zidane won the 1998 FIFA World Cup, scoring twice in the final, and was named to the All-Star team. This triumph made him a national hero in France and he received the Legion of Honour in 1998. He won UEFA Euro 2000 and was named Player of the Tournament. He also received the Golden Ball as Player of the Tournament at the 2006 World Cup, despite his infamous sending off in the final against Italy for headbutting Marco Materazzi in the chest. He retired as the fourth-most capped player in French history"
}
